<script setup>
import Footer from '@/components/Footer.vue'
import Header from '@/components/Header.vue'
</script>

<template>
  <Header />
  <section class="w-full flex justify-center mt-10">
    <div class="flex flex-col text-center">
      <p class="text-gray-800 text-3xl font-bold">개인정보 처리방침</p>
    </div>
  </section>

  <!-- 글귀 -->
  <section class="w-full mt-10 px-30">
    <h3 class="h3t">'(주)KitGet'(이하 '회사')은(는) 이용자의 개인정보 보호를 중요시하며, 이용자가 회사의 서비스를 이용함과 동시에 온라인상에서 회사에게 제공한 개인정보가 보호 받을 수 있도록 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 있으며, 다음과 같은 개인정보 처리방침을 두고 있습니다. 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다. 본 방침은부터 2025년 3월 22일부터 시행됩니다.</h3>
    <h2 class="h2t">개인정보의 수집 및 처리 목적</h2>
    <h3 class="h3t">회사가 이용자의 개인의 정보를 수집하는 목적은 이용자에게 최적의 서비스를 제공하기 위함임을 잊지 않겠습니다. 회사는 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 것입니다. 가. 회원가입 및 관리 회원가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 민원처리 및 고지·통지 등을 목적으로 개인정보를 처리합니다. 나. 재화 또는 서비스 제공 인구통계학적 특성에 따른 콘텐츠 제공, 서비스 제공, 물품배송, 본인인증, 요금결제·정산 등을 목적으로 개인정보를 처리합니다. 다. 마케팅 및 광고에의 활용 신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 서비스의 유효성 확인 등을 목적으로 개인정보를 처리합니다. 라. 서비스 개선 목적 연구 개발 서비스 기능 개선, 기술 개발 및 신규 서비스 출시 등을 목적으로 개인정보를 처리합니다.</h3>
    <h2 class="h2t">제 2조 (서비스의 중단)</h2>
    <h3 class="h3t">
      1. 코드의 보수점검, 교체 및 고장, 통신의 두절 등 사유가 발생한 경우 중단 될 수 있습니다<br />
      2. 팀은 프로젝트가 끝난 뒤 사이트 폐지를 결정할 권리가 있습니다<br />
      3. 팀은 본 조에 따른 서비스의 중단에 대하여 어떠한 책임도 부담하지 않습니다
    </h3>
    <h2 class="h2t">개인정보 수집항목 및 수집방법</h2>
    <h3 class="h3t">
      회사는 서비스 제공을 원활하게 하기 위해 필요한 최소한의 정보만을 수집하고 있으며, 이후 사용자의 편의를 위한 부가 서비스 제공을 위해 기타 정보를 추가로 수집할 수 있습니다. 회사가 수집하는 개인정보의 항목 및 방법은 아래와 같습니다.
      <br />회원가입 및 관리 : 필수항목 - 학번, 이메일 <br />서비스 이용 : 수집항목 - 접속로그, 서비스 이용 기록 <br />수집방법 : 이용자가 회원가입 시, 서비스 이용 중, 회원정보 수정 등을 통한 입력
    </h3>
    <h2 class="h2t">개인정보 수집 동의</h2>
    <h3 class="h3t">가입했다는건 사용하겠다는 뜻입니다.</h3>
    <h3 class="h3t">개인정보처리방침 공고 및 시행일자 : 2025년 3월 22일</h3>
  </section>

  <Footer />
</template>

<style scoped>
@import 'tailwindcss';

.h1t {
  @apply text-2xl;
}
.h2t {
  @apply text-xl mt-5 font-bold;
}
.h3t {
  @apply text-sm mt-5;
}
</style>
